[NoCoverage] BooleanLiteral
src/controllers/DeleteProductInputController.ts:9:13
     public async handle(request: FastifyRequest, response: FastifyReply): Promise<void> {
         const { productInputId } = request.params as { productInputId: string; };
 
-        if (!productInputId) {
+        if (productInputId) {
             return response.status(400).send({ error: "Product input ID is required" });
         }

[NoCoverage] BlockStatement
src/controllers/DeleteProductInputController.ts:9:30
     public async handle(request: FastifyRequest, response: FastifyReply): Promise<void> {
         const { productInputId } = request.params as { productInputId: string; };
 
-        if (!productInputId) {
-            return response.status(400).send({ error: "Product input ID is required" });
-        }
+        if (!productInputId) {}
 
         try {

[NoCoverage] StringLiteral
src/controllers/DeleteProductInputController.ts:10:55
         const { productInputId } = request.params as { productInputId: string; };
 
         if (!productInputId) {
-            return response.status(400).send({ error: "Product input ID is required" });
+            return response.status(400).send({ error: "" });
         }
 

[NoCoverage] ConditionalExpression
src/controllers/DeleteProductInputController.ts:18:17
 
             const getProductInputStatement = connection.prepare("SELECT * FROM product_inputs WHERE id = ?");
             const productInput = getProductInputStatement.get(productInputId) as { id: string; product_order_id: string; input_quantity: number; input_date: string } | undefined;
-            if (!productInput) {
+            if (false) {
                 return response.status(404).send({ error: "Product input not found" });
             }

[NoCoverage] ConditionalExpression
src/controllers/DeleteProductInputController.ts:18:17
 
             const getProductInputStatement = connection.prepare("SELECT * FROM product_inputs WHERE id = ?");
             const productInput = getProductInputStatement.get(productInputId) as { id: string; product_order_id: string; input_quantity: number; input_date: string } | undefined;
-            if (!productInput) {
+            if (true) {
                 return response.status(404).send({ error: "Product input not found" });
             }

[NoCoverage] StringLiteral
src/controllers/DeleteProductInputController.ts:19:59
             const getProductInputStatement = connection.prepare("SELECT * FROM product_inputs WHERE id = ?");
             const productInput = getProductInputStatement.get(productInputId) as { id: string; product_order_id: string; input_quantity: number; input_date: string } | undefined;
             if (!productInput) {
-                return response.status(404).send({ error: "Product input not found" });
+                return response.status(404).send({ error: "" });
             }
 

[NoCoverage] ConditionalExpression
src/controllers/DeleteProductInputController.ts:24:17
 
             const getProductOrderStatement = connection.prepare("SELECT * FROM product_orders WHERE id = ?");
-            if (!productOrder) {
+            if (false) {
                 return response.status(404).send({ error: "Product order not found" });
             }

[NoCoverage] BooleanLiteral
src/controllers/DeleteProductInputController.ts:24:17
 
             const getProductOrderStatement = connection.prepare("SELECT * FROM product_orders WHERE id = ?");
-            if (!productOrder) {
+            if (productOrder) {
                 return response.status(404).send({ error: "Product order not found" });
             }

[NoCoverage] BlockStatement
src/controllers/DeleteProductInputController.ts:30:27
 
             const getProductStatement = connection.prepare("SELECT * FROM products WHERE barcode = ?");
             const product = getProductStatement.get(productOrder.product_barcode) as { barcode: string; name: string; quantity_in_stock: number } | undefined;
-            if (!product) {
-                return response.status(404).send({ error: "Product not found" });
-            }
+            if (!product) {}
 
             if (product.quantity_in_stock < productInput.input_quantity) {

[NoCoverage] BooleanLiteral
src/controllers/DeleteProductInputController.ts:30:17
 
             const getProductStatement = connection.prepare("SELECT * FROM products WHERE barcode = ?");
             const product = getProductStatement.get(productOrder.product_barcode) as { barcode: string; name: string; quantity_in_stock: number } | undefined;
-            if (!product) {
+            if (product) {
                 return response.status(404).send({ error: "Product not found" });
             }

[NoCoverage] EqualityOperator
src/controllers/DeleteProductInputController.ts:34:17
                 return response.status(404).send({ error: "Product not found" });
             }
 
-            if (product.quantity_in_stock < productInput.input_quantity) {
+            if (product.quantity_in_stock <= productInput.input_quantity) {
                 return response.status(400).send({ error: "Cannot delete product input as it would result in negative stock" });
             }

[NoCoverage] ConditionalExpression
src/controllers/DeleteProductInputController.ts:34:17
                 return response.status(404).send({ error: "Product not found" });
             }
 
-            if (product.quantity_in_stock < productInput.input_quantity) {
+            if (true) {
                 return response.status(400).send({ error: "Cannot delete product input as it would result in negative stock" });
             }

[NoCoverage] ObjectLiteral
src/controllers/DeleteProductInputController.ts:35:50
             }
 
             if (product.quantity_in_stock < productInput.input_quantity) {
-                return response.status(400).send({ error: "Cannot delete product input as it would result in negative stock" });
+                return response.status(400).send({});
             }
 

[NoCoverage] ArithmeticOperator
src/controllers/DeleteProductInputController.ts:41:30
             const deleteStatement = connection.prepare("DELETE FROM product_inputs WHERE id = ?");
             deleteStatement.run(productInputId);
 
-            const newStock = product.quantity_in_stock - productInput.input_quantity;
+            const newStock = product.quantity_in_stock + productInput.input_quantity;
 
             const updateProductStatement = connection.prepare("UPDATE products SET quantity_in_stock = ? WHERE barcode = ?");

[NoCoverage] StringLiteral
src/controllers/DeleteProductInputController.ts:43:63
 
             const newStock = product.quantity_in_stock - productInput.input_quantity;
 
-            const updateProductStatement = connection.prepare("UPDATE products SET quantity_in_stock = ? WHERE barcode = ?");
+            const updateProductStatement = connection.prepare("");
             updateProductStatement.run(newStock, product.barcode);
 

[NoCoverage] StringLiteral
src/controllers/DeleteProductInputController.ts:46:68
             const updateProductStatement = connection.prepare("UPDATE products SET quantity_in_stock = ? WHERE barcode = ?");
             updateProductStatement.run(newStock, product.barcode);
 
-            const updateProductOrderStatement = connection.prepare("UPDATE product_orders SET status = ? WHERE id = ?");
+            const updateProductOrderStatement = connection.prepare("");
             updateProductOrderStatement.run("opened", productOrder.id);
 

[NoCoverage] StringLiteral
src/controllers/DeleteProductInputController.ts:47:45
             updateProductStatement.run(newStock, product.barcode);
 
             const updateProductOrderStatement = connection.prepare("UPDATE product_orders SET status = ? WHERE id = ?");
-            updateProductOrderStatement.run("opened", productOrder.id);
+            updateProductOrderStatement.run("", productOrder.id);
 
             return response.status(200).send({

[NoCoverage] BlockStatement
src/controllers/DeleteProductInputController.ts:54:28
              });
 
 
-        } catch (Newerror) {
-            return response.status(500).send({ error: Newerror });
-        }
+        } catch (Newerror) {}
     }
 }
