[Killed] BlockStatement
src/controllers/CreateProductController.ts:13:79
         this.createProductUseCase = createProductUseCase;
     }
 
-    async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
-        if(typeof request.body !== "object") {
-            reply.status(400).send({ error: "Invalid request body" });
-            return;
-        }
-        const { barcode, name } = request.body as { barcode: string, name: string };
-
-        const result = this.createProductUseCase.execute(barcode, name);
-
-        if (result instanceof InfrastructureError) {
-            reply.status(500).send({ error: result.message });
-            return;
-        }
-        
-        if (result instanceof Error) {
-            reply.status(400).send({ error: result.message });
-            return;
-        }
-
-        reply.status(201).send({ 
-            barcode: result.barcode, 
-            name: result.name, 
-            quantityInStock: result.quantityInStock 
-        });
-    }
+    async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {}
 
 }
killedBy: CreateProduct integration tests should create a product successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 0

[Killed] BlockStatement
src/controllers/CreateProductController.ts:14:46
     }
 
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
-        if(typeof request.body !== "object") {
-            reply.status(400).send({ error: "Invalid request body" });
-            return;
-        }
+        if(typeof request.body !== "object") {}
         const { barcode, name } = request.body as { barcode: string, name: string };
 
killedBy: Testing CreateProductController should return an error 400 if the body is not present
statusReason: TypeError: Cannot destructure property 'barcode' of 'request.body' as it is undefined.

[Killed] ConditionalExpression
src/controllers/CreateProductController.ts:14:12
     }
 
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
-        if(typeof request.body !== "object") {
+        if(false) {
             reply.status(400).send({ error: "Invalid request body" });
             return;
killedBy: Testing CreateProductController should return an error 400 if the body is not present
statusReason: TypeError: Cannot destructure property 'barcode' of 'request.body' as it is undefined.

[Killed] StringLiteral
src/controllers/CreateProductController.ts:15:45
 
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
         if(typeof request.body !== "object") {
-            reply.status(400).send({ error: "Invalid request body" });
+            reply.status(400).send({ error: "" });
             return;
         }
killedBy: Testing CreateProductController should return an error 400 if the body is not present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid request body",
+   "error": "",

[Killed] ObjectLiteral
src/controllers/CreateProductController.ts:15:36
 
     async handle(request: FastifyRequest, reply: FastifyReply): Promise<void> {
         if(typeof request.body !== "object") {
-            reply.status(400).send({ error: "Invalid request body" });
+            reply.status(400).send({});
             return;
         }
killedBy: Testing CreateProductController should return an error 400 if the body is not present
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "Invalid request body",
- }
