[Killed] ObjectLiteral
src/controllers/CreateProductOrderController.ts:36:43
             }
 
             // Sucesso na criação do recurso (Status 201)
-            return reply.status(201).send({ 
-                id: result.id,
-                product: {
-                    barcode: result.product.barcode,
-                    name: result.product.name,
-                    quantityInStock: result.product.quantityInStock
-                },
-                orderQuantity: result.orderQuantity,
-                orderDate: result.orderDate,
-                status: result.status
-            });
+            return reply.status(201).send({});
     }
 }
killedBy: Testing CreateProductOrderController should create a product order successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 11
+ Received  +  1

- Object {
-   "id": "random-uuid",
-   "orderDate": 2026-06-20T10:00:00.000Z,
