[Killed] BlockStatement
src/entities/ProductInput.ts:16:27
     productOrder: ProductOrder,
     inputQuantity: number,
     inputDate: Date,
-  ): ProductInput | Error {
-    if (!productOrder) {
-      return new Error("Product order is required");
-    }
-
-    if (!Number.isInteger(inputQuantity) || inputQuantity <= 0) {
-      return new Error("Input quantity must be a positive integer");
-    }
-
-    if (!inputDate || isNaN(inputDate.getTime())) {
-      return new Error("Invalid input date");
-    }
-
-    return new ProductInput(
-      crypto.randomUUID(),
-      productOrder,
-      inputQuantity,
-      inputDate,
-    );
-  }
+  ): ProductInput | Error {}
 
   public getId(): string {
killedBy: CreateProductInputUsecase tests should create an input for an existing product order
statusReason: TypeError: Cannot read properties of undefined (reading 'getId')

[Killed] ConditionalExpression
src/entities/ProductInput.ts:17:9
     inputQuantity: number,
     inputDate: Date,
   ): ProductInput | Error {
-    if (!productOrder) {
+    if (false) {
       return new Error("Product order is required");
     }
killedBy: testing ProductInput entity should reject a missing product order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

- [Error: Product order is required]
+ ProductInput {
+   "id": "9c88e33f-13fd-4175-9b37-d451dd8a242d",

[Killed] ConditionalExpression
src/entities/ProductInput.ts:17:9
     inputQuantity: number,
     inputDate: Date,
   ): ProductInput | Error {
-    if (!productOrder) {
+    if (true) {
       return new Error("Product order is required");
     }
killedBy: CreateProductInputUsecase tests should create an input for an existing product order
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not Error

[Killed] ConditionalExpression
src/entities/ProductInput.ts:21:9
       return new Error("Product order is required");
     }
 
-    if (!Number.isInteger(inputQuantity) || inputQuantity <= 0) {
+    if (true) {
       return new Error("Input quantity must be a positive integer");
     }
killedBy: testing ProductInput entity should create an input linked to a product order with a UUID
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ProductInput
Received constructor: Error

[Killed] ConditionalExpression
src/entities/ProductInput.ts:21:45
       return new Error("Product order is required");
     }
 
-    if (!Number.isInteger(inputQuantity) || inputQuantity <= 0) {
+    if (!Number.isInteger(inputQuantity) || false) {
       return new Error("Input quantity must be a positive integer");
     }
killedBy: CreateProductInputUsecase tests should return an error when the input entity rejects the quantity
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 16

- [Error: Input quantity must be a positive integer]
+ Object {
+   "id": "4ca4b38a-1777-4d17-a29c-9f0c4bfc6ede",

[Killed] BlockStatement
src/entities/ProductInput.ts:25:51
       return new Error("Input quantity must be a positive integer");
     }
 
-    if (!inputDate || isNaN(inputDate.getTime())) {
-      return new Error("Invalid input date");
-    }
+    if (!inputDate || isNaN(inputDate.getTime())) {}
 
     return new ProductInput(
killedBy: testing ProductInput entity should reject a missing input date
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

- [Error: Invalid input date]
+ ProductInput {
+   "id": "8c68fa72-cfa6-477e-b87b-720c7b73fe2b",

[Killed] BooleanLiteral
src/entities/ProductInput.ts:25:9
       return new Error("Input quantity must be a positive integer");
     }
 
-    if (!inputDate || isNaN(inputDate.getTime())) {
+    if (inputDate || isNaN(inputDate.getTime())) {
       return new Error("Invalid input date");
     }
killedBy: ProductInputRepository tests should create a product input
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ProductInput
Received constructor: Error

[Killed] BlockStatement
src/entities/ProductInput.ts:41:42
     return this.id;
   }
 
-  public getProductOrder(): ProductOrder {
-    return this.productOrder;
-  }
+  public getProductOrder(): ProductOrder {}
 
   public getProductOrderId(): string {
killedBy: testing ProductInput entity should create an input linked to a product order with a UUID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"id": "123e4567-e89b-12d3-a456-426614174000", "orderDate": 2024-01-01T12:00:00.000Z, "orderQuantity": 20, "product": {"barcode": "1234567890123", "name": "Biscoito Recheado", "quantityInStock": 100}, "status": "opened"}
Received: undefined

[Killed] BlockStatement
src/entities/ProductInput.ts:45:38
     return this.productOrder;
   }
 
-  public getProductOrderId(): string {
-    return this.productOrder.getId();
-  }
+  public getProductOrderId(): string {}
 
   public getInputQuantity(): number {
killedBy: testing ProductInput entity should create an input linked to a product order with a UUID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "123e4567-e89b-12d3-a456-426614174000"
Received: undefined

[Killed] BlockStatement
src/entities/ProductInput.ts:49:37
     return this.productOrder.getId();
   }
 
-  public getInputQuantity(): number {
-    return this.inputQuantity;
-  }
+  public getInputQuantity(): number {}
 
   public getInputDate(): Date {
killedBy: CreateProductInputUsecase tests should create an input for an existing product order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] BlockStatement
src/entities/ProductInput.ts:53:31
     return this.inputQuantity;
   }
 
-  public getInputDate(): Date {
-    return this.inputDate;
-  }
+  public getInputDate(): Date {}
 
   public formatInputDate(): string {
killedBy: CreateProductInputUsecase tests should create an input for an existing product order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2024-01-02T12:00:00.000Z
Received: undefined

[Killed] BlockStatement
src/entities/ProductInput.ts:57:36
     return this.inputDate;
   }
 
-  public formatInputDate(): string {
-    return this.inputDate.toISOString().replace("T", " ").replace(/\.\d{3}Z$/, "Z");
-  }
+  public formatInputDate(): string {}
 }
 
killedBy: testing ProductInput entity should create an input linked to a product order with a UUID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-01-02 12:00:00Z"
Received: undefined

[Killed] Regex
src/entities/ProductInput.ts:58:67
   }
 
   public formatInputDate(): string {
-    return this.inputDate.toISOString().replace("T", " ").replace(/\.\d{3}Z$/, "Z");
+    return this.inputDate.toISOString().replace("T", " ").replace(/\.\D{3}Z$/, "Z");
   }
 }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "id": "be975f16-6c1f-4352-b519-735a34017d9c",
-   "input_date": "2024-01-02 12:00:00Z",

[Killed] StringLiteral
src/entities/ProductInput.ts:58:54
   }
 
   public formatInputDate(): string {
-    return this.inputDate.toISOString().replace("T", " ").replace(/\.\d{3}Z$/, "Z");
+    return this.inputDate.toISOString().replace("T", "").replace(/\.\d{3}Z$/, "Z");
   }
 }
killedBy: ProductInputRepository tests should create a product input
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "id": "5eb91c42-58cd-4afb-8ae9-23b3d7aabb02",
-   "input_date": "2024-01-02 12:00:00Z",
