[Killed] BlockStatement
src/entities/ProductOrder.ts:10:110
     private orderDate: Date;
     private status: string;
 
-    private constructor(id: string, product: Product, orderQuantity: number, orderDate: Date, status: string){
-        this.id = id;
-        this.product = product;
-        this.orderQuantity = orderQuantity;
-        this.orderDate = orderDate;
-        this.status = status;
-    }
+    private constructor(id: string, product: Product, orderQuantity: number, orderDate: Date, status: string){}
 
     public static create(product: Product, orderQuantity: number, orderDate: Date): ProductOrder | Error{
killedBy: ProductInputRepository tests should create a product input
statusReason: Error: expect(received).toBeUndefined()

Received: [InfrastructureError: Failed to create product input]

[Killed] BlockStatement
src/entities/ProductOrder.ts:18:105
         this.status = status;
     }
 
-    public static create(product: Product, orderQuantity: number, orderDate: Date): ProductOrder | Error{
-        if(orderQuantity <= 0){
-            return new Error("A quantidade do pedido deve ser maior que zero.");
-        }
-
-        if(this.isInteger(orderQuantity) === false){
-            return new Error("A quantidade do pedido deve ser um número inteiro.");
-        }
-
-        if(orderDate > new Date()){
-            return new Error("A data do pedido não pode ser no futuro.");
-        }
-
-        if(!product){
-            return new Error("O produto do pedido é obrigatório.");
-        }
-
-        return new ProductOrder(
-            crypto.randomUUID(),
-            product,
-            orderQuantity,
-            orderDate,
-            "opened"
-        );
-    }
+    public static create(product: Product, orderQuantity: number, orderDate: Date): ProductOrder | Error{}
 
     public static rebuild(
killedBy: testing ProductInput entity should only format a date suffix when it is at the end
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ProductOrder

Received value has no prototype
Received value: undefined

[Killed] ConditionalExpression
src/entities/ProductOrder.ts:19:12
     }
 
     public static create(product: Product, orderQuantity: number, orderDate: Date): ProductOrder | Error{
-        if(orderQuantity <= 0){
+        if(true){
             return new Error("A quantidade do pedido deve ser maior que zero.");
         }
killedBy: testing ProductInput entity should only format a date suffix when it is at the end
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ProductOrder
Received constructor: Error

[Killed] EqualityOperator
src/entities/ProductOrder.ts:19:12
     }
 
     public static create(product: Product, orderQuantity: number, orderDate: Date): ProductOrder | Error{
-        if(orderQuantity <= 0){
+        if(orderQuantity > 0){
             return new Error("A quantidade do pedido deve ser maior que zero.");
         }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ProductOrder
Received constructor: Error

[Killed] BooleanLiteral
src/entities/ProductOrder.ts:23:46
             return new Error("A quantidade do pedido deve ser maior que zero.");
         }
 
-        if(this.isInteger(orderQuantity) === false){
+        if(this.isInteger(orderQuantity) === true){
             return new Error("A quantidade do pedido deve ser um número inteiro.");
         }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ProductOrder
Received constructor: Error

[Killed] ConditionalExpression
src/entities/ProductOrder.ts:23:12
             return new Error("A quantidade do pedido deve ser maior que zero.");
         }
 
-        if(this.isInteger(orderQuantity) === false){
+        if(true){
             return new Error("A quantidade do pedido deve ser um número inteiro.");
         }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ProductOrder
Received constructor: Error

[Killed] EqualityOperator
src/entities/ProductOrder.ts:27:12
             return new Error("A quantidade do pedido deve ser um número inteiro.");
         }
 
-        if(orderDate > new Date()){
+        if(orderDate <= new Date()){
             return new Error("A data do pedido não pode ser no futuro.");
         }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ProductOrder
Received constructor: Error

[Killed] ConditionalExpression
src/entities/ProductOrder.ts:31:12
             return new Error("A data do pedido não pode ser no futuro.");
         }
 
-        if(!product){
+        if(false){
             return new Error("O produto do pedido é obrigatório.");
         }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toBeUndefined()

Received: [InfrastructureError: Failed to create product order]

[Killed] BlockStatement
src/entities/ProductOrder.ts:50:21
         orderQuantity: number,
         orderDate: Date,
         status: string,
-    ): ProductOrder {
-        return new ProductOrder(id, product, orderQuantity, orderDate, status);
-    }
+    ): ProductOrder {}
 
     private static isInteger(value: number): boolean {
killedBy: ProductOrderRepository tests should find a product order by id
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ProductOrder

Received value has no prototype
Received value: null

[Killed] BlockStatement
src/entities/ProductOrder.ts:74:32
         return this.orderDate;
     }
 
-    public getStatus(): string {
-        return this.status;
-    }
+    public getStatus(): string {}
 
     public formatOrderDate(): string{
killedBy: ProductInputRepository tests should create a product input
statusReason: Error: expect(received).toBeUndefined()

Received: [InfrastructureError: Failed to create product input]

[Killed] StringLiteral
src/entities/ProductOrder.ts:79:58
     }
 
     public formatOrderDate(): string{
-        return this.orderDate.toISOString().replace('T', ' ').replace(/\.\d{3}Z$/, 'Z');
+        return this.orderDate.toISOString().replace('T', "").replace(/\.\d{3}Z$/, 'Z');
     }
 }
killedBy: ProductOrderRepository tests should find a product order by id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2024-01-01T12:00:00.000Z
Received: Date { NaN }

[Killed] Regex
src/entities/ProductOrder.ts:79:71
     }
 
     public formatOrderDate(): string{
-        return this.orderDate.toISOString().replace('T', ' ').replace(/\.\d{3}Z$/, 'Z');
+        return this.orderDate.toISOString().replace('T', ' ').replace(/\.\D{3}Z$/, 'Z');
     }
 }
killedBy: testing ProductOrder entity should format order date correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-01-01 12:00:00Z"
Received: "2024-01-01 12:00:00.000Z"
