[Killed] StringLiteral
src/repositories/ProductInputRepository.ts:12:5
 
 export class ProductInputRepository implements ProductInputRepositoryInterface {
   private static readonly INSERT_PRODUCT_INPUT =
-    "INSERT INTO product_inputs (id, product_order_id, input_quantity, input_date) VALUES (?, ?, ?, ?)";
+    "";
 
   private readonly sqliteConnection: SqliteConnection;
killedBy: ProductInputRepository tests should create a product input
statusReason: Error: expect(received).toBeUndefined()

Received: [InfrastructureError: Failed to create product input]

[Killed] BlockStatement
src/repositories/ProductInputRepository.ts:20:73
     this.sqliteConnection = connection;
   }
 
-  public create(productInput: ProductInput): void | InfrastructureError {
-    try {
-      const connection: Database.Database = this.sqliteConnection.getConnection();
-      const insertStatement = connection.prepare(
-        ProductInputRepository.INSERT_PRODUCT_INPUT,
-      );
-      insertStatement.run(
-        productInput.getId(),
-        productInput.getProductOrderId(),
-        productInput.getInputQuantity(),
-        productInput.formatInputDate(),
-      );
-    } catch (error) {
-      return new InfrastructureError("Failed to create product input");
-    }
-  }
+  public create(productInput: ProductInput): void | InfrastructureError {}
 }
 
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": "319e5189-cefd-4c0e-aab1-2d5320f866bc", "input_date": "2024-01-02 12:00:00Z", "input_quantity": 20, "product_order_id": "dce26f08-c940-4bc8-b033-9f1c01b7e6c1"}
Received: undefined

[Killed] BlockStatement
src/repositories/ProductInputRepository.ts:21:9
   }
 
   public create(productInput: ProductInput): void | InfrastructureError {
-    try {
-      const connection: Database.Database = this.sqliteConnection.getConnection();
-      const insertStatement = connection.prepare(
-        ProductInputRepository.INSERT_PRODUCT_INPUT,
-      );
-      insertStatement.run(
-        productInput.getId(),
-        productInput.getProductOrderId(),
-        productInput.getInputQuantity(),
-        productInput.formatInputDate(),
-      );
-    } catch (error) {
+    try {} catch (error) {
       return new InfrastructureError("Failed to create product input");
     }
killedBy: ProductInputRepository tests should create a product input
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": "7dba01b4-f5a8-4bd3-aa72-55f1283092dc", "input_date": "2024-01-02 12:00:00Z", "input_quantity": 20, "product_order_id": "8f717512-b269-416c-b9a7-ee80753dab29"}
Received: undefined

[Killed] BlockStatement
src/repositories/ProductInputRepository.ts:32:21
         productInput.getInputQuantity(),
         productInput.formatInputDate(),
       );
-    } catch (error) {
-      return new InfrastructureError("Failed to create product input");
-    }
+    } catch (error) {}
   }
 }
killedBy: ProductInputRepository tests should return an infrastructure error when creating an input fails
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [InfrastructureError: Failed to create product input]
Received: undefined

[Killed] StringLiteral
src/repositories/ProductInputRepository.ts:33:38
         productInput.formatInputDate(),
       );
     } catch (error) {
-      return new InfrastructureError("Failed to create product input");
+      return new InfrastructureError("");
     }
   }
killedBy: ProductInputRepository tests should return an infrastructure error when creating an input fails
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [InfrastructureError: Failed to create product input]
Received: [InfrastructureError]
