[Killed] BlockStatement
src/repositories/ProductOrderRepository.ts:21:75
         this.sqliteConnection = connection;
     }
 
-    public create(productOrder: ProductOrder): void | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            const insertStatement = connection.prepare(
-                "INSERT INTO product_orders (id, product_barcode, order_quantity, order_date, status) VALUES (?, ?, ?, ?, ?)"
-            );
-            insertStatement.run(
-                productOrder.getId(),
-                productOrder.getProduct().getBarcode(),
-                productOrder.getOrderQuantity(),
-                productOrder.formatOrderDate(),
-                productOrder.getStatus()
-            );
-        } catch (error) {
-            return new InfrastructureError("Failed to create product order");
-        }
-    }
+    public create(productOrder: ProductOrder): void | InfrastructureError {}
 
     public findById(id: string): ProductOrder | null | InfrastructureError {
killedBy: ProductInputRepository tests should create a product input
statusReason: Error: expect(received).toBeUndefined()

Received: [InfrastructureError: Failed to create product input]

[Killed] BlockStatement
src/repositories/ProductOrderRepository.ts:22:13
     }
 
     public create(productOrder: ProductOrder): void | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            const insertStatement = connection.prepare(
-                "INSERT INTO product_orders (id, product_barcode, order_quantity, order_date, status) VALUES (?, ?, ?, ?, ?)"
-            );
-            insertStatement.run(
-                productOrder.getId(),
-                productOrder.getProduct().getBarcode(),
-                productOrder.getOrderQuantity(),
-                productOrder.formatOrderDate(),
-                productOrder.getStatus()
-            );
-        } catch (error) {
+        try {} catch (error) {
             return new InfrastructureError("Failed to create product order");
         }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toBeUndefined()

Received: [InfrastructureError: Database error]

[Killed] BlockStatement
src/repositories/ProductOrderRepository.ts:60:23
                 quantity_in_stock: number;
             } | undefined;
 
-            if (!row) {
-                return null;
-            }
+            if (!row) {}
 
             return ProductOrder.rebuild(
killedBy: ProductOrderRepository tests should return null when a product order does not exist
statusReason: Error: expect(received).toBeNull()

Received: [InfrastructureError: Database error]

[Killed] BlockStatement
src/repositories/ProductOrderRepository.ts:71:25
                 new Date(row.order_date),
                 row.status,
             );
-        } catch (error) {
-            return new InfrastructureError("Database error");
-        }
+        } catch (error) {}
     }
 
killedBy: ProductOrderRepository tests should return an infrastructure error when finding an order fails
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [InfrastructureError: Database error]
Received: undefined

[Killed] BlockStatement
src/repositories/ProductOrderRepository.ts:76:58
         }
     }
 
-    public close(id: string): void | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            connection.prepare(
-                "UPDATE product_orders SET status = ? WHERE id = ?",
-            ).run("closed", id);
-        } catch (error) {
-            return new InfrastructureError("Database error");
-        }
-    }
+    public close(id: string): void | InfrastructureError {}
 }
 
killedBy: ProductOrderRepository tests should close a product order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "closed"
Received: "opened"

[Killed] BlockStatement
src/repositories/ProductOrderRepository.ts:77:13
     }
 
     public close(id: string): void | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            connection.prepare(
-                "UPDATE product_orders SET status = ? WHERE id = ?",
-            ).run("closed", id);
-        } catch (error) {
+        try {} catch (error) {
             return new InfrastructureError("Database error");
         }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/repositories/ProductOrderRepository.ts:82:25
             connection.prepare(
                 "UPDATE product_orders SET status = ? WHERE id = ?",
             ).run("closed", id);
-        } catch (error) {
-            return new InfrastructureError("Database error");
-        }
+        } catch (error) {}
     }
 }
killedBy: ProductOrderRepository tests should return an infrastructure error when closing an order fails
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [InfrastructureError: Database error]
Received: undefined
