[Killed] BlockStatement
src/repositories/ProductRepository.ts:53:94
         }
     }
 
-    public updateStock(barcode: string, quantityInStock: number): void | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            connection.prepare(
-                "UPDATE products SET quantity_in_stock = ? WHERE barcode = ?",
-            ).run(quantityInStock, barcode);
-        } catch (error) {
-            return new InfrastructureError("Database error");
-        }
-    }
+    public updateStock(barcode: string, quantityInStock: number): void | InfrastructureError {}
 }
 
killedBy: ProductRepository tests should update a product stock
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 100

[Killed] BlockStatement
src/repositories/ProductRepository.ts:54:13
     }
 
     public updateStock(barcode: string, quantityInStock: number): void | InfrastructureError {
-        try {
-            const connection: Database.Database = this.sqliteConnection.getConnection();
-            connection.prepare(
-                "UPDATE products SET quantity_in_stock = ? WHERE barcode = ?",
-            ).run(quantityInStock, barcode);
-        } catch (error) {
+        try {} catch (error) {
             return new InfrastructureError("Database error");
         }
killedBy: ProductRepository tests should update a product stock
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 100

[Killed] BlockStatement
src/repositories/ProductRepository.ts:59:25
             connection.prepare(
                 "UPDATE products SET quantity_in_stock = ? WHERE barcode = ?",
             ).run(quantityInStock, barcode);
-        } catch (error) {
-            return new InfrastructureError("Database error");
-        }
+        } catch (error) {}
     }
 }
killedBy: ProductRepository tests should return an infrastructure error when updating stock fails
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [InfrastructureError: Database error]
Received: undefined
