[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:34:9
   execute(productOrderId: string, inputQuantity: number, inputDate: Date): CreateProductInputDTO | Error {
     const productOrderResult = this.productOrderRepository.findById(productOrderId);
 
-    if (productOrderResult instanceof InfrastructureError) {
+    if (true) {
       return productOrderResult;
     }
killedBy: CreateProductInputUsecase tests should create an input for an existing product order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"id": "80804e62-b70f-4bdf-b4b9-896a60e2e1f5", "orderDate": 2024-01-01T12:00:00.000Z, "orderQuantity": 20, "product": {"barcode": "1234567890123", "name": "Biscoito Recheado", "quantityInStock": 100}, "status": "opened"}
Received: undefined

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:34:9
   execute(productOrderId: string, inputQuantity: number, inputDate: Date): CreateProductInputDTO | Error {
     const productOrderResult = this.productOrderRepository.findById(productOrderId);
 
-    if (productOrderResult instanceof InfrastructureError) {
+    if (false) {
       return productOrderResult;
     }
killedBy: CreateProductInputUsecase tests should return an infrastructure error when finding the product order fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: [InfrastructureError: Database error]
Received: [Error: Product order does not exist]

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:38:9
       return productOrderResult;
     }
 
-    if (!(productOrderResult instanceof ProductOrder)) {
+    if (false) {
       return new Error("Product order does not exist");
     }
killedBy: CreateProductInputUsecase tests should return an error when the product order does not exist
statusReason: TypeError: Cannot read properties of null (reading 'getStatus')

[Killed] BooleanLiteral
src/usecases/CreateProductInputUsecase.ts:38:9
       return productOrderResult;
     }
 
-    if (!(productOrderResult instanceof ProductOrder)) {
+    if (productOrderResult instanceof ProductOrder) {
       return new Error("Product order does not exist");
     }
killedBy: CreateProductInputUsecase tests should create an input for an existing product order
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not Error

[Killed] BlockStatement
src/usecases/CreateProductInputUsecase.ts:42:54
       return new Error("Product order does not exist");
     }
 
-    if (productOrderResult.getStatus() !== "opened") {
-      return new Error("Product order is not in opened status");
-    }
+    if (productOrderResult.getStatus() !== "opened") {}
 
     if (inputDate < productOrderResult.getOrderDate()) {
killedBy: CreateProductInputUsecase tests should reject an input when the product order is not open
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 16

- [Error: Product order is not in opened status]
+ Object {
+   "id": "1138fbc7-a50a-4519-aaea-1a43db0976c0",

[Killed] EqualityOperator
src/usecases/CreateProductInputUsecase.ts:42:9
       return new Error("Product order does not exist");
     }
 
-    if (productOrderResult.getStatus() !== "opened") {
+    if (productOrderResult.getStatus() === "opened") {
       return new Error("Product order is not in opened status");
     }
killedBy: CreateProductInputUsecase tests should create an input for an existing product order
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not Error

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:46:9
       return new Error("Product order is not in opened status");
     }
 
-    if (inputDate < productOrderResult.getOrderDate()) {
+    if (false) {
       return new Error("Input date cannot be before the product order date");
     }
killedBy: CreateProductInputUsecase tests should reject an input dated before the product order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 16

- [Error: Input date cannot be before the product order date]
+ Object {
+   "id": "6418a237-3ec7-43f8-b935-bb26ff3d0a1c",

[Killed] BlockStatement
src/usecases/CreateProductInputUsecase.ts:46:56
       return new Error("Product order is not in opened status");
     }
 
-    if (inputDate < productOrderResult.getOrderDate()) {
-      return new Error("Input date cannot be before the product order date");
-    }
+    if (inputDate < productOrderResult.getOrderDate()) {}
 
     const productInput = ProductInput.create(
killedBy: CreateProductInputUsecase tests should reject an input dated before the product order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 16

- [Error: Input date cannot be before the product order date]
+ Object {
+   "id": "352b744a-1bc2-46c1-94f3-cbe585416497",

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:56:9
       inputDate,
     );
 
-    if (productInput instanceof Error) {
+    if (true) {
       return productInput;
     }
killedBy: CreateProductInputUsecase tests should create an input for an existing product order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"id": "f0577ab7-6eaf-4276-86d6-18016a3807cc", "orderDate": 2024-01-01T12:00:00.000Z, "orderQuantity": 20, "product": {"barcode": "1234567890123", "name": "Biscoito Recheado", "quantityInStock": 100}, "status": "opened"}
Received: undefined

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:56:9
       inputDate,
     );
 
-    if (productInput instanceof Error) {
+    if (false) {
       return productInput;
     }
killedBy: CreateProductInputUsecase tests should return an error when the input entity rejects the quantity
statusReason: TypeError: productInput.getId is not a function

[Killed] BlockStatement
src/usecases/CreateProductInputUsecase.ts:62:54
 
     const createResult = this.productInputRepository.create(productInput);
 
-    if (createResult instanceof InfrastructureError) {
-      return createResult;
-    }
+    if (createResult instanceof InfrastructureError) {}
 
     let resultProductOrder = productOrderResult;
killedBy: CreateProductInputUsecase tests should return an infrastructure error when creating the input fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -  1
+ Received  + 16

- [InfrastructureError: Failed to create product input]
+ Object {
+   "id": "45a71d34-2bb9-450e-99b4-c7b099efe176",

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:62:9
 
     const createResult = this.productInputRepository.create(productInput);
 
-    if (createResult instanceof InfrastructureError) {
+    if (true) {
       return createResult;
     }
killedBy: CreateProductInputUsecase tests should create an input for an existing product order
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:67:9
     }
 
     let resultProductOrder = productOrderResult;
-    if (this.productStockRepository) {
+    if (true) {
       const product = productOrderResult.getProduct();
       const newStock = product.getQuantityInStock() + inputQuantity;
killedBy: CreateProductInputUsecase tests should create an input for an existing product order
statusReason: TypeError: Cannot read properties of undefined (reading 'updateStock')

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:67:9
     }
 
     let resultProductOrder = productOrderResult;
-    if (this.productStockRepository) {
+    if (false) {
       const product = productOrderResult.getProduct();
       const newStock = product.getQuantityInStock() + inputQuantity;
killedBy: CreateProductInputUsecase tests should stop when updating the product stock fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -  1
+ Received  + 16

- [InfrastructureError: Database error]
+ Object {
+   "id": "47af9ea2-326b-4334-93a6-2ad5bc058e1b",

[Killed] ArithmeticOperator
src/usecases/CreateProductInputUsecase.ts:69:24
     let resultProductOrder = productOrderResult;
     if (this.productStockRepository) {
       const product = productOrderResult.getProduct();
-      const newStock = product.getQuantityInStock() + inputQuantity;
+      const newStock = product.getQuantityInStock() - inputQuantity;
       const updateStockResult = this.productStockRepository.updateStock(
         product.getBarcode(),
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 80

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:75:11
         newStock,
       );
 
-      if (updateStockResult instanceof InfrastructureError) {
+      if (true) {
         return updateStockResult;
       }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Object

Received value has no prototype
Received value: undefined

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:75:11
         newStock,
       );
 
-      if (updateStockResult instanceof InfrastructureError) {
+      if (false) {
         return updateStockResult;
       }
killedBy: CreateProductInputUsecase tests should stop when updating the product stock fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -  1
+ Received  + 16

- [InfrastructureError: Database error]
+ Object {
+   "id": "70fcb485-6632-4b60-bf4a-f8d9bde8db86",

[Killed] BlockStatement
src/usecases/CreateProductInputUsecase.ts:82:55
       const closeResult = this.productOrderRepository.close(
         productOrderResult.getId(),
       );
-      if (closeResult instanceof InfrastructureError) {
-        return closeResult;
-      }
+      if (closeResult instanceof InfrastructureError) {}
 
       resultProductOrder = ProductOrder.rebuild(
killedBy: CreateProductInputUsecase tests should stop when closing the product order fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -  1
+ Received  + 16

- [InfrastructureError: Database error]
+ Object {
+   "id": "582bec27-3bc9-497d-97af-994def23ac8a",

[Killed] ConditionalExpression
src/usecases/CreateProductInputUsecase.ts:82:11
       const closeResult = this.productOrderRepository.close(
         productOrderResult.getId(),
       );
-      if (closeResult instanceof InfrastructureError) {
+      if (false) {
         return closeResult;
       }
killedBy: CreateProductInputUsecase tests should stop when closing the product order fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -  1
+ Received  + 16

- [InfrastructureError: Database error]
+ Object {
+   "id": "f65d9322-406c-425e-8341-21f8b6798a6d",

[Killed] StringLiteral
src/usecases/CreateProductInputUsecase.ts:91:9
         Product.rebuild(product.getBarcode(), product.getName(), newStock),
         productOrderResult.getOrderQuantity(),
         productOrderResult.getOrderDate(),
-        "closed",
+        "",
       );
     }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "closed"
Received: ""

[Killed] ObjectLiteral
src/usecases/CreateProductInputUsecase.ts:95:12
       );
     }
 
-    return {
-      id: productInput.getId(),
-      productOrder: resultProductOrder,
-      inputQuantity: productInput.getInputQuantity(),
-      inputDate: productInput.getInputDate(),
-    };
+    return {};
   }
 }
killedBy: CreateProductInput integration tests should create and persist an input for a product order
statusReason: TypeError: Cannot read properties of undefined (reading 'getId')
