[Killed] BlockStatement
src/usecases/CreateProductOrderUsecase.ts:40:53
 
     execute(barcode: string, orderQuantity: number, orderDate: Date): CreateProductOrderDTO | Error {
         const product = this.productRepository.findByBarcode(barcode);
-        if (product instanceof InfrastructureError) {
-            return product;
-        }
+        if (product instanceof InfrastructureError) {}
         if (!(product instanceof Product)) {
             return new Error("Product does not exist");
killedBy: CreateProductOrder integration tests should return 500 if the connection with the database fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 400

[Killed] StringLiteral
src/usecases/CreateProductOrderUsecase.ts:44:30
             return product;
         }
         if (!(product instanceof Product)) {
-            return new Error("Product does not exist");
+            return new Error("");
         }
 
killedBy: CreateProductOrderUsecase tests should return an Error when the product does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Product does not exist"
Received: ""

[Killed] BlockStatement
src/usecases/CreateProductOrderUsecase.ts:48:44
         }
 
         const productOrder = ProductOrder.create(product, orderQuantity, orderDate);
-        if (productOrder instanceof Error) {
-            return productOrder;
-        }
+        if (productOrder instanceof Error) {}
 
         const createResult = this.productOrderRepository.create(productOrder);
killedBy: CreateProductOrderUsecase tests should return an Error when the product order entity returns an error
statusReason: TypeError: productOrder.getId is not a function

[Killed] ConditionalExpression
src/usecases/CreateProductOrderUsecase.ts:53:13
         }
 
         const createResult = this.productOrderRepository.create(productOrder);
-        if (createResult instanceof InfrastructureError) {
+        if (true) {
             return createResult;
         }
killedBy: CreateProductOrder integration tests should create a product order successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'id')
